app/Controllers/Pegawai/Dashboard.php

    public function index()
    {

        $tercapai = $this->detail_penialain_model->countTercapaiStatusByPegawai(session()->get('id_pegawai'));
        $tidak_tercapai = $this->detail_penialain_model->countTidakTercapaiStatusByPegawai(session()->get('id_pegawai'));
        $status_by_month = $this->detail_penialain_model->showStatusByMonth(session()->get('id_pegawai'));
        $absensi = $this->absensi_model->checkAbsensiToday(session()->get('id_pegawai'));

        $data = [
            "title" => "Dashboard Pegawai",
            "jumlah_informasi" => $this->informasi_model->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `informasi`

    public function get_count_tugas_and_informasi()
    {
        $data = [
            "total_tugas" => $this->bagian_model->countTotalByIdPegawai(session()->get('id_pegawai')),
            "total_informasi" => $this->informasi_model->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `informasi`