app/Controllers/Penilai/Penilaian.php

    public function create()
    {
        $data = [
            "title" => "Tambah Penilaian",
            "data_pegawai" => $this->pegawai_model->findAll(),
            "data_bagian" => $this->bagian_model->findAll(),
---
SELECT *
FROM `pegawai`
SELECT *
FROM `bagian`