app/Controllers/Autentikasi.php

    public function login_action()
    {
        $validation = Services::validation();
        $validation->setRules([
            'email' => 'required|min_length[5]|valid_email',
            'password' => 'required|min_length[5]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->route("login");
        }

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $pengguna = $this->pengguna_model->where('email', $email)->first();
---
SELECT *
FROM `pengguna`
WHERE `email` = 'pegawai@mail.com'
 LIMIT 1

                        return redirect()->route("login");
                    }
                } else if ($pengguna["role"] == 0) {
                    $pegawai = $this->pegawai_model->where('id_pengguna', $pengguna["id"])->first();
---
SELECT *
FROM `pegawai`
WHERE `id_pengguna` = '2'
 LIMIT 1